app/controllers/material_quantidades_controller.rb

  def index
    @material_quantidades = MaterialQuantidade.all
---
SELECT `material_quantidades`.* FROM `material_quantidades`

  def create
    byebug
    @material_quantidade = MaterialQuantidade.new(material_quantidade_params)

    respond_to do |format|
      if @material_quantidade.save
---
INSERT INTO `material_quantidades` (`material_id`, `quantidade`, `created_at`, `updated_at`) VALUES (1, 2, '2018-06-13 21:39:29', '2018-06-13 21:39:29')

    def set_material_quantidade
      @material_quantidade = MaterialQuantidade.find(params[:id])
---
SELECT  `material_quantidades`.* FROM `material_quantidades` WHERE `material_quantidades`.`id` = 1 LIMIT 1